app/Controllers/Auth/ProfileController.php

    public function ProfileView(?int $id = null)
    {
		helper('number');
		helper('torrent');

		$pager = service('pager');

		$no_torrents = false;

		if (!$id)
		{
       		$id = $this->userData->id;
        }

		// Get the User Provider (UserModel by default)
		$users = auth()->getProvider();
		$data['user'] = $users->withGroups()->findById((int) $id);

   	    if (!$this->userData->logged_in)
		             return redirect()->to('user/login')->with('error', lang('Login.needLogin'));

        if (!$data['user'])
		             return redirect()->back()->with('error', lang('Login.errorViewProfile'));

		$data['groups'] = $data['user']->groups;
    	$data['torrcount'] = $this->TorrentModel->where('owner', $data['user']->id)->where('deleted_at', null)->countAllResults();
        $data['commcount'] = $this->CommentModel->where('user_id', $data['user']->id)->where('deleted_at', null)->countAllResults();
        $data['bookcount'] = $this->BookmarkModel->where('user_id', $data['user']->id)->where('deleted_at', null)->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "torrents"
WHERE "owner" = 1
AND "deleted_at" IS NULL
AND "torrents"."deleted_at" IS NULL
SELECT COUNT(*) AS "numrows"
FROM "comments"
WHERE "user_id" = 1
AND "deleted_at" IS NULL
SELECT COUNT(*) AS "numrows"
FROM "bookmarks"
WHERE "user_id" = 1
AND "deleted_at" IS NULL