<?php
declare(strict_types=1);

return [
    // Exceptions
		'Categories'  => 'Категории',
		'Category' => [
				'name' => 'Категория',
				'url' => 'Короткая ссылка',
				'urldesc' => 'Если ссылка пустая, она преобразуется из названия.',
				'sort' => 'Порядок сортировки',
				'sortdesc' => 'Чем меньше, тем выше отображение категории на главной.',
				'img' => 'Изображение',
				'catid' => 'Ид',
				'desc' => 'Описание',
			],
		'NotFind' => 'Категории ещё не созданы',
		'NotFound' => 'Категория не найдена',
		'Delete' => 'Удалить',
		'Create' => 'Создать категорию',
		'Edit' => 'Редактировать',
		'EditSuccess' => 'Категория успешно отредактирована',
		'AddSuccess' => 'Категория успешно создана',
		'EditFault' => 'Вы ничего не изменили',
		'List' => 'Список категорий', 
		'Manage' => 'Управление',
		'search' => 'Поиск',
		'reset' => 'Сброс',
		'search-plh' => 'Введите текст для поиска',
    'sform-error' => 'Поисковая фраза - не менее 3х символов',
     ];
?>