<?php
declare(strict_types=1);

return [
    // Exceptions
    'comments' => 'Комментарии',
    'text'  => 'Текст комментария',
    'created_at' => 'Создан',
    'torrent' => 'Торрент',
    'add' => 'Добавить комментарий',
    'send' => 'Отправить',
    'addforbidden' => 'Запрещено добавлять коментарии',
    'notext' => 'Комментарий не может быть пустой',
    'unknownerror' => 'Неизвестная ошибка',
    'addsuccess' => 'Комментарий успешно добавлен',
		'quote' => 'Цитировать',
		'edit' => 'Редактировать',
		'delete' => 'Удалить',
		'report' => 'Жалоба',
		'no_comment' => 'Нет комментариев.',
];
?>