<?php
declare(strict_types=1);

return [
    // Exceptions
    'list' => 'Список',
    'commmanage' => 'Менеджер комментариев',
    'comments' => 'Комментарии',
    'text'  => 'Текст комментария',
    'created_at' => 'Создан',
    'torrent' => 'Торрент',
    'add' => 'Добавить комментарий',
    'send' => 'Отправить',
    'addforbidden' => 'Запрещено добавлять коментарии',
    'notext' => 'Комментарий не может быть пустой',
    'unknownerror' => 'Неизвестная ошибка',
    'addsuccess' => 'Комментарий успешно добавлен',
	'quote' => 'Цитировать',
	'edit' => 'Редактировать',
	'delete' => 'Удалить',
	'delete_success' => 'Комментарий удалён',
	'report' => 'Жалоба',
	'no_comment' => 'Нет комментариев.',
	'id'	=>	'Ид',
	'author'	=>	'Автор',
	'material'	=>	'Тип материала',
	'updated_at'	=>	'Обновлён',
	'manadge'	=>	'Управление',
	'by_author'	=>	'Выбрать по автору',
	'by_material'	=>	'Выбрать по материалу',
	'sort' => 'Сортировать по:',
	'sortfields'	=>	[
			'created_at' => 'По дате создания',
			'updated_at' => 'По дате обновления',
			'user_id' => 'По пользователю',
			'fid' => 'По материалу'
	],
];
?>