<?php
declare(strict_types=1);

return [
    // Exceptions
    'news'  => 'Новости',
    'listnews'  => 'Список новостей',
    'addnews'  => 'Добавить новость',
    'editnews'  => 'Редактировать новость',
		'title' => 'Заголовок новости',
		'text' => 'Текст новости',
		'textdesr' => 'Обратите внимание, текст новости не должен превышать 10 000 символов, вместе с HTML тегами. Всё что больше обрезается.<br />Пожалуйста учтите это при написании, во избежании проблем !',
		'send' => 'Создать новость',
		'cancomment' => 'Разрешить комментарии',
		'id' => 'Ид',
		'created_at' => 'Создана',
		'updated_at' => 'Обновлена',
		'deleted_at' => 'Удалена',
		'manadge' => 'Управление',
		'delete' => 'Удалить новость',
		'harddelete' => 'Удалить навсегда',
		'restore' => 'Восстановить',
		'edit' => 'Редактировать',
		'editsuccess' => 'Новость успешно отредактирована.',
		'deletesuccess' => 'Новость успешно удалена, но вы всегда можете восстановить её.',
		'harddeletesuccess' => 'Новость полностью удалена из базы данных, восстановление невозможно !',
		'restoresuccess' => 'Новость успешно восстановлена.',
		'notfind' => 'Вы ещё не создали новости.',
		'addsuccess' => 'Новость успешно добавлена.',
//		'' => '',
];
