app/Models/Admin/CategoryModel.php

    function getCatList(): array {
        return $this->db->table('categories')->orderBy('sort', 'asc')->get()->getResult();
---
SELECT *
FROM "categories"
ORDER BY "sort" ASC

    function getCatById(int $id) {
        return $this->db->table('categories')->where('id', $id)->get()->getRow();
---
SELECT *
FROM "categories"
WHERE "id" = 3

    function CatUpdate($id, $data) {
        $this->db->table('categories')->where('id', $id)->set($data)->update();
---
UPDATE "categories" SET "img" = 'series.png'
WHERE "id" = 3