app/Controllers/AjaxController.php

  public function AjaxPag()
  {
			helper('number');
			helper('torrent');

  		$catId = (int) $this->request->getPost('catid');
  		$event = (string) $this->request->getPost('event');
  		$action = (string) $this->request->getPost('action');
  		$offset = (int) $this->request->getPost('offset');
      if ($event == 'forward') {
      	$offset = $offset + setting('Torrent.torrentsPerCatOnIndex');
      }
      elseif ($event == 'backward') {
      	$offset = $offset - setting('Torrent.torrentsPerCatOnIndex');
      }
      $offset = ($offset <= 0) ? 0 : $offset;

      $torrCount = $this->TorrentModel->where('category', $catId)->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "torrents"
WHERE "category" = 1
AND "torrents"."deleted_at" IS NULL

	public function getUserComments()
	{
   	  helper('number');
   	  helper('torrent');
   	  helper('smiley');
   	  $perPage = setting('Torrent.profileCommentsPerPage');

   		$data = [];

			$userId = (int) $this->request->getPost('uid');

			$direction = (string) $this->request->getPost('direction');

			if(! $userId || ! $this->userData->logged_in)
  											throw PageNotFoundException::forPageNotFound();

			$offset = (int) $this->request->getPost('offset');

			if($direction == 'forward') {
					$offset = $offset + $perPage;
			} elseif ($direction == 'backward') {
					$offset = $offset - $perPage;
			}
//			var_dump($offset); die();
			$data['offset'] = ($offset <= 0) ? 0 : $offset;

			$data['comCount'] = $this->CommentModel->where('user_id', $userId)->where('deleted_at', null)->countAllResults();

			$data['comList'] = $this->CommentModel->asObject()->where('comments.user_id', $userId)
															->withTorrents()->orderBy('comments.created_at', 'desc')
															->findAll($perPage, $offset);
---
SELECT COUNT(*) AS "numrows"
FROM "comments"
WHERE "user_id" = 1
AND "deleted_at" IS NULL
SELECT "torrents"."url" as "turl", "torrents"."name" as "tname", "torrents"."id" as "tid", "comments".*
FROM "comments"
LEFT JOIN "torrents" ON "torrents"."id" = "comments"."fid"
WHERE "comments"."user_id" = 1
ORDER BY "comments"."created_at" DESC
 LIMIT 20