app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
				// Preload any models, libraries, etc, here.
        parent::initController($request, $response, $logger);

				$this->setting = service('settings');

				$this->TorrConfig = config('Torrent');

				$this->translit = \Transliterator::create('Any-Latin; Latin-ASCII');

				$this->GlobalModel = model(GlobalModel::class);
				$this->StatsModel = model(StatsModel::class);

				// Cache data news on index page
				if (! $this->news = cache('news')) {
				    $this->NewsModel = model(NewsModel::class);

						$this->news = $this->NewsModel->asObject()->orderBy('created_at', 'desc')->findAll(setting('Torrent.newsPerIndex'));
---
SELECT *
FROM "news"
WHERE "news"."deleted_at" IS NULL
ORDER BY "created_at" DESC
 LIMIT 3