app/Controllers/ModController.php

SELECT "c"."url" as "caturl", "c"."id", "c"."name" as "catname", "torrents".*, "u"."username"
FROM "torrents"
LEFT JOIN "categories" "c" ON "c"."id" = "torrents"."category"
LEFT JOIN "users" "u" ON "u"."id" = "torrents"."owner"
WHERE "torrents"."modded" = 0
AND "torrents"."deleted_at" IS NULL
AND "torrents"."deleted_at" IS NULL
 LIMIT 20
SELECT COUNT(*) AS "numrows"
FROM "torrents"
LEFT JOIN "categories" "c" ON "c"."id" = "torrents"."category"
LEFT JOIN "users" "u" ON "u"."id" = "torrents"."owner"
WHERE "torrents"."modded" = 0
AND "torrents"."deleted_at" IS NULL
AND "torrents"."deleted_at" IS NULL
---
    public function UncheckView()
    {
    	  helper('number');
    	  helper('torrent');
    	  $pager = service('pager');

		  $no_torrents = false;

          if(! $this->isMod)
					throw PageNotFoundException::forPageNotFound();

		 $torrents = $this->TorrentModel->asObject()->select('c.url as caturl, c.id, c.name as catname, torrents.*, u.username')
            ->join('categories c', 'c.id = torrents.category', 'left')
            ->join('users u', 'u.id = torrents.owner', 'left')
		 	->where('torrents.modded', 0)
		 	->where('torrents.deleted_at', null)
		 	->paginate(setting('Torrent.torrentsPerPage'));