app/Controllers/TorrentController.php

	   			'ogimage' => $torrentData->poster,
	   			'bbcode' => new BBCodeParser(),
      			'icon' => $status['icon'],
      			'title' => $status['title'],
      			'class' => $status['class'],
      			'details' => $torrentData,
		      	'poster' => img($torrentData->poster),
		      	'can_delete' => ($this->isMod || $can_edit),
				'can_edit' => $can_edit,
				'moderate' => $this->isMod,
				'download' => (setting('Torrent.allowUploadTorrent') === true) && in_array((int) $torrentData->modded, setting('Torrent.statusAllowDownload')),
				'allowmagnet' => ($torrentData->modded === "1" || $torrentData->modded === "0"),
				'allowreport' => (setting('Torrent.allowreport') === true),
				'allowFileList' => (setting('Torrent.allowFileList') === true),
				'filestree' => (setting('Torrent.allowFileList') === true) ? $torrentFile->toTree() : null,
				'cats' => ($this->isMod) ? $cats : null,
				'comments' => $comments['comments'] ?? null,
				'paginate' => $this->CommentModel->pager,
				'canCommentEdit' => ($this->userData->logged_in && $this->userData->can('comment.ownededit')),
				'canCommentDelete' => ($this->userData->logged_in && $this->userData->can('comment.owneddelete')),
				'smilies' => $table->generate($col_array),
				'announceList' => count($annList) > 0 ? $annList : ['No tracker'],
				'bookmark' => $this->BookmarkModel->where(['user_id' => $this->userData->id, 't_id' => $torrentData->id])->first(),
			];
---
SELECT *
FROM `bookmarks`
WHERE `user_id` = 1
AND `t_id` = '112'
 LIMIT 1