app/Models/GlobalModel.php

    function getCats() {
        	return $this->db->table('categories')
        					->select('*')
        					->where('deleted_at =', null)
									->groupBy('id')
                	->orderBy('sort', 'ASC')
                	->get()->getResult();
---
SELECT *
FROM `categories`
WHERE `deleted_at` IS NULL
GROUP BY `id`
ORDER BY `sort` ASC

    function getCatHome() {
        	return $this->db->table('categories')
        					->select('categories.*, COUNT(torrents.id) AS count')
									->join('torrents', 'torrents.category = categories.id', 'left')
									->where('categories.deleted_at =', null)
									->where('torrents.deleted_at =', null)
									->groupBy('categories.id')
                	->orderBy('categories.sort', 'ASC')
                	->get()->getResult();
---
SELECT `categories`.*, COUNT(torrents.id) AS count
FROM `categories`
LEFT JOIN `torrents` ON `torrents`.`category` = `categories`.`id`
WHERE `categories`.`deleted_at` IS NULL
AND `torrents`.`deleted_at` IS NULL
GROUP BY `categories`.`id`
ORDER BY `categories`.`sort` ASC

    public function getTorrentByCat(int $cid, int $limit = 10, int $offset = 0) {
        return $this->db->table('torrents t')->select('t.id, t.owner, t.size, t.type, t.name, t.category, t.created_at, t.poster, t.url, t.modded, t.seed, t.leech, t.views, t.downloaded, t.completed, t.version, u.username, c.name AS catname, c.url AS caturl')
                        ->join('users u', 'u.id = t.owner', 'left')
                        ->join('categories c', 'c.id = '.$cid , 'left')
                        ->where(['category' => $cid])
                        ->where('t.deleted_at =', null)
//                        ->where('added BETWEEN UNIX_TIMESTAMP(DATE_SUB(NOW(), INTERVAL 1 DAY)) AND UNIX_TIMESTAMP(NOW())')
//                        ->where('added > UNIX_TIMESTAMP(CURDATE())')
                        ->orderBy("t.created_at", "DESC")
                        ->limit($limit, $offset)
                        ->get()->getResult();
---
SELECT `t`.`id`, `t`.`owner`, `t`.`size`, `t`.`type`, `t`.`name`, `t`.`category`, `t`.`created_at`, `t`.`poster`, `t`.`url`, `t`.`modded`, `t`.`seed`, `t`.`leech`, `t`.`views`, `t`.`downloaded`, `t`.`completed`, `t`.`version`, `u`.`username`, `c`.`name` AS `catname`, `c`.`url` AS `caturl`
FROM `torrents` `t`
LEFT JOIN `users` `u` ON `u`.`id` = `t`.`owner`
LEFT JOIN `categories` `c` ON `c`.`id` = 5
WHERE `category` = 5
AND `t`.`deleted_at` IS NULL
ORDER BY `t`.`created_at` DESC
 LIMIT 5, 5

    public function getAllTorrent(int $limit = 10, int $offset = 0) {
        return $this->db->table('torrents t')->select('t.id, t.owner, t.size, t.type, t.name, t.category, t.created_at, t.poster, t.url, t.modded, t.seed, t.leech, t.views, t.downloaded, t.completed, t.version, u.username, c.name AS catname, c.url AS caturl')
                        ->join('users u', 'u.id = t.owner', 'left')
                        ->join('categories c', 'c.id = t.category', 'left')
                        ->where('t.deleted_at =', null)
                        ->orderBy("t.created_at", "DESC")
                        ->limit($limit, $offset)
                        ->get()->getResult();
---
SELECT "t"."id", "t"."owner", "t"."size", "t"."type", "t"."name", "t"."category", "t"."created_at", "t"."poster", "t"."url", "t"."modded", "t"."seed", "t"."leech", "t"."views", "t"."downloaded", "t"."completed", "t"."version", "u"."username", "c"."name" AS "catname", "c"."url" AS "caturl"
FROM "torrents" "t"
LEFT JOIN "users" "u" ON "u"."id" = "t"."owner"
LEFT JOIN "categories" "c" ON "c"."id" = "t"."category"
WHERE "t"."deleted_at" IS NULL
ORDER BY "t"."created_at" DESC
 LIMIT 20

    function getTorrentCount(?int $id = null)
    {
        	$query = $this->db->table('torrents')->where('deleted_at =', null)->select('COUNT(id) AS count');
---
SELECT COUNT(id) AS count
FROM "torrents"
WHERE "deleted_at" IS NULL