app/Models/StatsModel.php

SELECT SUM(leech) as leechers, SUM(seed) AS seeders, COUNT(id) AS torrents, SUM(size) AS size
FROM `torrents`
---
    public function displayStats()
    {
    		helper('number');

        if (!$stats = cache('stats')) {
            $stats = $this->db->table('torrents')
            			->select('SUM(leech) as leechers, SUM(seed) AS seeders, COUNT(id) AS torrents, SUM(size) AS size')
            			->get()->getRow();