app/Models/TorrentModel.php

		public function update($id = null, $row = null): bool
    {
        $query = $this->db->table($this->table);
        $query->where('id', $id);
        return $query->set($row)->update();
---
UPDATE "torrents" SET "category" = 3
WHERE "id" = 9

		public function getDetail(int $tId)
		{
		  $q = $this->db->table($this->table.' AS t')->select('t.*, c.name AS catname, c.url AS caturl, c.desc AS catdesc, u.username, u.avatar, r.fid AS rid, r.comment AS rtext, r.created_at AS radded, r.sender AS rsender, r.modded_by AS rmodded')
                ->join('categories c', 'c.id = t.category', 'left')
                ->join('users u', 'u.id = t.owner', 'left')
                ->join('reports r', 'r.fid = '.$tId, 'left')
                ->where('t.id', (int) $tId)
                ->limit(1)->get()->getRow();
---
SELECT `t`.*, `c`.`name` AS `catname`, `c`.`url` AS `caturl`, `c`.`desc` AS `catdesc`, `u`.`username`, `u`.`avatar`, `r`.`fid` AS `rid`, `r`.`comment` AS `rtext`, `r`.`created_at` AS `radded`, `r`.`sender` AS `rsender`, `r`.`modded_by` AS `rmodded`
FROM `torrents` AS `t`
LEFT JOIN `categories` `c` ON `c`.`id` = `t`.`category`
LEFT JOIN `users` `u` ON `u`.`id` = `t`.`owner`
LEFT JOIN `reports` `r` ON `r`.`fid` = 112
WHERE `t`.`id` = 112
 LIMIT 1

		function updateViews($id) {
        $query = $this->db->table($this->table)->set('views', 'views + 1', FALSE)->where('id', $id);
        return $query->update();
---
UPDATE `torrents` SET `views` = views + 1
WHERE `id` = 112